## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/audit-trail/76aa3543-dcb9-433d-a49c-ebd7038a1819).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpplhf6mf5/plan`

```diff
2024-12-02T08:34:46.964Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T08:34:46.964Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T08:34:46.964Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T08:34:46.964Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T08:34:46.964Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T08:34:46.964Z [INFO]  Go runtime version: go1.21.11
2024-12-02T08:34:46.964Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpplhf6mf5/plan"}
2024-12-02T08:34:46.964Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T08:34:46.964Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T08:34:46.964Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T08:34:46.964Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T08:34:46.964Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T08:34:46.964Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T08:34:46.964Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T08:34:46.964Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T08:34:46.964Z [INFO]  CLI command args: []string{"show", "/tmp/tmpplhf6mf5/plan"}
2024-12-02T08:34:47.057Z [DEBUG] checking for provisioner in "."
2024-12-02T08:34:47.057Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T08:34:47.057Z [DEBUG] created provider logger: level=debug
2024-12-02T08:34:47.057Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T08:34:47.071Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T08:34:47.071Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=306
2024-12-02T08:34:47.071Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T08:34:47.083Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T08:34:47.083Z
2024-12-02T08:34:47.098Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1729965771 network=unix timestamp=2024-12-02T08:34:47.098Z
2024-12-02T08:34:47.098Z [DEBUG] provider: using plugin: version=6
2024-12-02T08:34:47.138Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T08:34:47.139Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=306
2024-12-02T08:34:47.139Z [DEBUG] provider: plugin exited
2024-12-02T08:34:47.139Z [DEBUG] created provider logger: level=debug
2024-12-02T08:34:47.139Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T08:34:47.145Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T08:34:47.145Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=315
2024-12-02T08:34:47.145Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T08:34:47.149Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T08:34:47.149Z
2024-12-02T08:34:47.164Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin2938049642 network=unix timestamp=2024-12-02T08:34:47.164Z
2024-12-02T08:34:47.164Z [DEBUG] provider: using plugin: version=5
2024-12-02T08:34:47.176Z [DEBUG] No provider meta schema returned
2024-12-02T08:34:47.177Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T08:34:47.177Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=315
2024-12-02T08:34:47.177Z [DEBUG] provider: plugin exited
2024-12-02T08:34:47.177Z [DEBUG] created provider logger: level=debug
2024-12-02T08:34:47.178Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T08:34:47.183Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T08:34:47.183Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=324
2024-12-02T08:34:47.183Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T08:34:47.232Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T08:34:47.232Z
2024-12-02T08:34:47.252Z [DEBUG] provider: using plugin: version=5
2024-12-02T08:34:47.252Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin3274329410 network=unix timestamp=2024-12-02T08:34:47.252Z
2024-12-02T08:34:47.270Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x9cV]l\xd7\xeeڻ\xf6\xf5\xfag\x8f\xff\xeb\xbf\xf1\xb5\x8dw{\xc6;\xb6\xf9I\x81`\xe5/DV\x8d\xaa\xa8Q\xe4\xb3\xd7\xeb\xe3\x99\xed\xcc\xec\x82\xdf\xf6\xa1\x8d\xa8Z\xb5\x95\xd2V}LT\xf2P\xa8H\x89\xa8"!\xb5jAE\xa4\x81\xb6\xe2\xa1"-\x8d"BT\x88\xbaս\xb3\xbb^c\xa0\xb6v\xef\xf7s\xce=\xe7\xdesw\xff\xbf\xaeߺx\xfd\xce\xf5\xd71$\xa8
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: I5g\xee]\xb99\xf7M\xf1\xf1[\xf93\xb7\x83H oߺRMC$ \xf7	BTC;H>8w\xb5\x9aI\xcc\xd3\xa9\x86_\xa3
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: j\xb1V"	B\xaa\xa1\xeb\xa40R\x8dW\xee^\xe5>Ax\xb7J\xb0\x82P\x8f\xf5\xe2\xeb?\xe4X~X\xb0Aj\xa4@B\xf8\xd6\xdd\xab\x81\xef\xfa\xbah\xc2&)B;H\xfe\xe1\xe3<~- \x9f\xfa\xeaZ \xa99A\x81l\x91"4Bj\xf1\xec5\xc1\xadK\x84\xa8\x83Vl\x95"\xc1\xcf|\xc2C\x84\xe1l\x83\xc0\xc2ІmR;\x8d\x90:<s\xebT\x88I=$T\xd8!uR a|\xff\xfc\xdb!"p\xceϬQ\xda@\x81\xd4\xe3\x95_\xbcñF\xb8\xe0c\x8dŨ\xd4E\x814\xe0\x85\xces\xac	\xde\xf5\xf3m\x82n\xec\x96zh\x844\xe2;\xe7\xce\xf3pȉp\xe8\xc5^5\xe1\xdd3\xf7i\x90 \xb4\xa0\xfb$\x89\x89\xe0\xb9?\xac\xa2!\xd2}\xc7f\xe8\xc7~\x89\xb6 \x8072	TUC5\xb5\xa4.\\xdf\xd0\xd8ķ\xf8\xb37Dg[\xe0\x9a\xef\xd88 \xd5\xd0vҌ\xff\xcd\xff\x89W\xb6N\xd0 i\x83\x9d"d+\xe2\xa0hlᐴ\x91i\xc1\x8f\xde\x8dm/5\xaf\x86qX
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xd3Ҋω\xc6v\xc04H:\xe1\xe1\xd31\x8cI\xe1!\x9dǸht~\xbf\xf2\xd0iǷ>\xbaÓ@\xc8
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: B\xd2&\xdaA:\xf0\x83\x939\xb4h\x88D\xe1\xef~\x957\xc0\x8eH\x9b\x84DaG%\x99\xe9\xc4\xef}\xf1\xde\xde.8\xed\xb3\xba@AE`\x88\x8fJ=\xe4}j\xe9,ի	\x9a[Z\xdb\xda;:\xb1T\xae\xf8م\xcbܦn\x87E:\xdd0\x86c\xe2"D\xf1֥\xab<\x9dph\x88\xf4\xc2\xe7~z \x89IQ\xaf^PQ\x87\xbd\xff\xfd\x89\xa8W~Y
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4O\xfe\xe6C\xee\xdc?\xf2u}0\x8e\xe3\xa2*=\xf8\xd3\xfb\xe2\xf8K\xf0G?y	&pB\xff^<}O\xe9~h\xa3!B\xe1\xac\xcf\xe8\x87I\x9cǟ\xc2f\xdc,\xcex\x9ez |\xe0c\x9f5 [p\x8b\xb8\xfe\xed\xe1?y\xf6\x83\xd0#66[q\xab\xb4\x8d\xe9\xc7\xef\xdc\xfa\x82\xa76\x97j6/\xe0\xd2Wi\x84P|\xef\xe6.\xdb\xb4\xb6\xe3v\xe0\xafNΡa\xd8,\xa0a؁;\xa4\x9d\xc8 ^\xfbݧ\xdc1\xe7\xeb\x83\xf1Ei\xed!C\xf8Ʃ;A"qx\xa6!\x92\x80{a$\x9b\xc0>x\xe20\x85SҮ!	؍\xbbŧM0\x8d\xd3\xd2
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d#\xbe\xe9!\x8f\xc0\x8f\xfd*\x8e\xc0^\xdc+}\x8d\xc6\xdf\xde\xfe9\xbfr\xa3\xf0\xc8\xdf\xc6(\xec\xc3}\xd2~
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: $\x86\xef\xfdU`2\xfc\xd9\xc7d8\x80\xc7\xdf_\x98Rھ񠴿%Z:(\xcd\xa2]\xdd=\xbd}R?\xda8\x8bG\x81 \x9f\xcfWa\xfe\xd2\xfd\xc6ء\xad\x81h\xa9\x82\xfc?n^\xfe\xb2Ї\xf97\xffr\xf9\xcbB_\xec\xa5h\x94TC>\x9fT(
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x85 \xe6\xdf\xcc?*
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x85B vX\xfd\x8aZ\xebj\x8b\x93\xb9jH\xb7\xb3\x96\xa7V뙬Zoi\x96\xed2ݶR\xae:\xa4;K\xcfV\x98i\xcf\xd0\xc3\xf2\x98ci\xa62oh\x9e\x9c\x99T\x93S\xa9\x94:\xa2;\xebД̤\x9a\x9c\x9b74o󄜶\xd51\xddY\x87-\xc73\x93jr\xaf\xc9\x99\xe5\xc5\xe5\xa9T\xea)i\xff\xf5\x8d-\xc3\xf5\x98^\xb4\x9e\xb1\x8d\x92\xf1\xf0S\xf1e\xeb-O!\xae\xb4\x9e\xd55SsgMO\x8d\xadʼ\xd3Y'Ǌ\xacݚ\xcb\xb3s\xb3K\x80\x9er5\xd95\xd2\xd6>f1\xc7\xd0\xd5\xf6JD\xf1\xf1\xb4\xad6W.\x81\xdaU\xb9\xe43\xe7,[s\xe7\xcfiK\xed\xab\xe4\xf3\xcd9FN\xf3\xd8!\xb6\xf7	=Eɱm\xf2\xb4\xc34\x8fM3\xc73\xe6]\xf3\x98\xdaZ\xfb\x9c\xb4\xadnJ\xdeB\xf6\xa8\xacۋʂ\xe6.\xba\xedd\x94\xb4=\x9a1\xb3iÒ\xd3\xccb\x8e\xe6\xa9\xa3\xeb\x93w\xe5\x92\xf2\x84<\xa1,z\xa6˽ק˳\xcc\xc91UY\x9fU2u9\xd9ᶻ\xd7x\xccq\xb4y\xdbY,f>\x9a\xb6o>\xe3؞\x9d\x9bT\xbc\xf9ɢ\x81\xf4\xf0\xb3z\xecʍ\xc9\xdb\xe4\xe4ZVϟ\x92\x9b:\xa6\xe4T\xa5X\xdarN~J{\x9e-%\xdfcWN\x95\x93[䱢\x97\x9f
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: /ζ\xe7q)\xaa\x8b5\xa9[\xd4K\xe6\xffT\xa9\xa2\x9a\x8e\x9d3R\xccՎi\xee\x82\xc2a\xa7\xc1\xc9Z\x9e\xb1\xc8|~\xa4\xf8M\xc98\xb6\xce\xe1\xd5WLy|H\xcd~;\xab9L/\x9eJf\x9a\xc6\xe3l\xd5\xe4\xf9\xbfD\xacs<ud\xddH\xe2j\xcf\x82\xcaw\xa0>\x91폡bf\xc5\xc1ut\xc9c\xeesjvM\xff\xaa8b	\xd7#\xf6\xd4\xfc\xbca\xb1\x95\xf7:\xa39.\xdb;\xbd|\xf9W\xdek\x97\xe9b3\x8fi\xa2Ũ\xfc\xa6
2024-12-02T08:34:47.433Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xc7
2024-12-02T08:34:47.435Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xbfҨ\xf2L\x97\xff\xf1btT\xd0_\x99\xdbv\x88-\xcdh\x86\xf3\x94G@l\xe5p\xd6|\xceׅ+\x9e|*֪\xfe;{\xd4d\xea`1\xcb\xd2Q\xf1+纘饭\xfb\xa39\xc7c~\xa94\xbcK#\xb2[\xb5\xf8!X~\xc4\xe0/N;\x9cT\x8aI\xf0\xca\xfa\xe6\xfb5+\xe5.h\xc7\x9f⚗u\x98ڲLR\xb4\xac\xb7 \xa7mu\xc7\xf2\x9aK\xf8\xd3jY\xeai;\xf2\xd2lr<.;LKM\x9b\xb3\xbc\xca\xe9^\xda<\xef\xdaB)\xe2\x9co3\xe7\x99nr\x9cI>k\x90\xb2\x85JWH\xa6mˊ˾m9;\xb5w\x99\xf3Xp\xb6\xb2(\xb1\xa2G9´my섷\xa2(\xbam\x891\xb3\x96\xb0\xb6$\xec^\x8e^v/\x93ԝi\xdbN\x9b|8\x9a\x9a\x95\x96m'\xad\xa4\x9d\x8c\xae\xe8K1\xcb34\x93\xab<ӝvXʍ\xfbðboɵ\xf5\xe2]\xda*\x8fU\xfa\xf0\xe2\xf3\xedn_[\xb2<=G\xb3܌\xedx\xf2\xcb\xec\xb8\xffΑҒ:\xb5\xb6\xba\xb0<J\xcb.ʂ\xe7e\xd4b\xb3y\xea\xdar,\xe1\x8b\xcb;\xbe\xffȑu9llmM9\xac\xdfs\xee.\xafͬp\xe7\xbd5\xd9׵\xe3\xfc\xb8\xa8#O勬\xe4\xf9\xac\xa5\x8f\xab'\xc5_\xcaq\xdb9\xe6f4\x9d)\xa6\xb6\xc4W\xd1m\x87)r\xf9m⯍x\x9b\\xc5ai\xc3\xf5\x9c\xa5eP6l\xc5\xcc.\xb2\xe3\xec\xa8\xe2?]crRN*\xa6aeO\xcci\x8b\xa9\xcd\x95\xbfV\xbcrs9\xc1Uk^ͥ\\xfb55\xfcj\xce]ru\xcd4_\xfb_   \xff\xfft\xef\xe8$B  
2024-12-02T08:34:47.436Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=324
2024-12-02T08:34:47.436Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
